backend/src/main/resources/templates/AuszahlungSapService/SST_073_ImportStatusRead.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:be.ch:KTBE_ERP_FI:IMPORT_STATUS">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ImportStatusRead_Request>
         <SENDER>
            <SYSID>{dto.sysId}</SYSID>
            <!--Optional:-->
            <BETRIEB/>
            <!--Optional:-->
            <VERSION>1.0</VERSION>
         </SENDER>
         <FILTER_PARMS>
            <!--Optional:-->
            <DELIVERY_ID>{dto.deliveryId}</DELIVERY_ID>
            <!--Optional:-->
            <SHOW_DETAILS>true</SHOW_DETAILS>
            <!--Optional:-->
            <STATUS/>
            <!--Optional:-->
            <OFFSET/>
            <!--Optional:-->
            <LIMIT/>
         </FILTER_PARMS>
      </urn:ImportStatusRead_Request>
   </soapenv:Body>
</soapenv:Envelope>
